import { NavLink } from 'react-router-dom';
import './Main.css';

function Main() {
    return (
        <main>
            <div className="inner-container">
                <p> 
                    <span className='title-logo'>ShareNotes</span> - это сервис для обмена заметками. Легкий в понимании и использовании, он упорстит Вашу работу и повседневность. 
                </p>
                <p className="subheading"> 
                    Хотите отправить заметку, но не знаете как? Все просто:  
                </p>
                <ol>
                    <li>Зайдите на вкладку 'Create' и введите текст в поле.</li>
                    <li>Нажмите кнопку 'Создать' и подождите, пока появится адресс заметки.</li>
                    <li>Скопируйте ссылку и передайте получателю. Если, по каким-то причинам, Вы не можете передать весь адрес, то копируйте только хеш(набор букв после последнего знака '/').</li>
                    <li>Если нужно создать найти заметку нажмите кнопку 'Создать еще'.</li>
                </ol> 
                <p className="subheading"> 
                    С Вами поделились заметкой и Вы хотите ее прочитать?
            </p>
            <p> 
                    Для начала определитесь, что именно Вы получили: ссылку или хеш(непонятный набор букв). Если это - ссылка, то просто вставьте ее в строку поиска Вашего браузера. Если Вы получили хеш, то следуйте следующей инструкции:
                </p>
                <ol>
                    <li>Зайдите на вкладку 'Note' и вставьте хеш в поле.</li>
                    <li>Нажмите кнопку 'Найти' и подождите, пока появится текст заметки.</li>
                    <li>Если нужно повторно найти заметку нажмите кнопку 'Найти еще'.</li>
                </ol> 
                <p className="subheading center">&#9660; Начните работу с сервисом прямо сейчас &#9660;</p>
                <div className='box-link'>
                    <NavLink to="/create" className='link-btn'>Создать note</NavLink>
                    <NavLink to="/note" className='link-btn'>Посмотреть note</NavLink>
                </div>
            </div>
        </main>
    );
}

export default Main;